// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

// let arr = [1, 2, 3, 4, 5, 'a', 'b', 'c', 'd', 'e']

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

// let arr = [];
// arr[0] = 5;
// console.log(arr)

// - є масив [2,17,13,6,22,31,45,66,100,-18]

let arr = [2,17,13,6,22,31,45,66,100,-18];

// 1. перебрати його циклом while

// let i = 0;
// while (i < arr.length){
//     console.log(arr[i])
//     i++
// }

//     2. перебрати його циклом for

// for (let i = 0; i < arr.length; i++){
//     console.log(arr[i])
// }

//     3. перебрати циклом while та вивести  числа тільки з непарним індексом

// let i = 0;
// while (i < arr.length){
//     if ([i] % 2 === 1){
//         console.log([i])
//         console.log(arr[i])
//     }
//     i++
// }

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

// for (let i = 0; i < arr.length; i++){
//     if ([i] % 2 === 1){
//         console.log([i])
//         console.log(arr[i]);
//     }
// }

// 5. перебрати циклом while та вивести  числа тільки парні  значення

// let i = 0;
// while (i < arr.length){
//     if (arr[i] % 2 === 0){
//         console.log(arr[i])
//     }
//     i++
// }

// 6. перебрати циклом for та вивести  числа тільки парні  значення

// for (let i = 0; i < arr.length; i++){
//     if (arr[i] % 2 === 0){
//         console.log(arr[i])
//     }
// }

// 7. замінити кожне число кратне 3 на слово "okten"

// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] % 3 === 0){
//         arr[i] = 'okten'
//     }
// }
// console.log(arr)

// 8. вивести масив в зворотньому порядку.

// for (let i = arr.length-1; i >= 0; i--){
//     console.log(arr[i])
// }

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)



