// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
//
// if (friends.length >= 3){
//     console.log('Це великий масив, в якому 3 і більше елементів.')
// } else {
//     console.log('це маленький масив, в якому менше 3-х елементів.')
// }


// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let a = Math.round(Math.random()*300);
// let b = Math.round(Math.random()*300);
// let c = Math.round(Math.random()*300);
// console.log(a);
// console.log(b);
// console.log(c);

// if (a > b && a < c) {
//     console.log(a)
// } else if (a < b && a > c){
//     console.log(a)
// } else if (b > a && b < c){
//     console.log(b)
// } else if (b < a && b > c){
//     console.log(b)
// } else if (c > a && c < b){
//     console.log(c)
// } else {
//     console.log(c)
// }






// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

// let a = 1;
// let b = 1;
// let result = (a + b < 4) ? 'malo' : 'bagato';
// console.log(result)


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
// let a = 0;
//
// let result = a < 0 ? 'негативне число' :
//     a === 0 ? 'нуль' :
//         'позитивне' ;
// console.log(result);








// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test = true;

// if (test === true){
//     console.log('Вірно')
// } else {
//     console.log('Неправильно')
// }

// !!test ? console.log('Вірно') : console.log('Неправильно');




// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let nameJS = prompt('Яка «офіційна» назва JavaScript?')
// if (nameJS === 'ECMAScript') {
//     console.log('Правильно')
// } else {
//     console.log('Не знаєте? ECMAScript')
// }



//     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let habbit = +prompt('??');
// if (habbit <= 20){
//     console.log('Перший')
// } else if (habbit >48){
//     console.log('Третій')
// } else {
//     console.log('Другий')
// }

// habbit <= 20 ? console.log('Перший') :
//     habbit >= 49 ? console.log('Третій') :
//         console.log('Другий')


// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let nubmer = +prompt('number?');
//
// nubmer === 10 ? console.log('Вірно') :
//     console.log('НЕВІРНО');


// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let temperature = +prompt('??');
//
// temperature >= 10 && temperature <= 22 ? console.log('ми йдемо ВЧИТИСЯ') :
//     console.log('вчимося ОНЛАЙН');





// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let number = +prompt('??');
//
// switch (number) {
//     case 1 :
//         console.log('Авто')
//         break;
//     case 2 :
//         console.log('мото')
//         break;
//     case 3 :
//         console.log('квартира')
//         break;
//     case 4 :
//         console.log('телефон')
//         break;
//     case 5 :
//         console.log('ноутбук')
//         break;
//     default :
//         console.log('число не вірне')
// }